org/reference/double_entry_accounting.org
:PROPERTIES:
:ID:       6d4756c2-a98d-46d7-bffd-fa7f204d8375
:END:
#+title: Double-entry Accounting

Double-entry accounting has several five components:

- Assets :: what you have
- Liability :: what you owe
-  ::

From here you can derive certain values:

- Net worth :: assets - liabilities
- Net income :: income - expenses

* Resources
- [[https://django-hordak.readthedocs.io/en/latest/accounting-for-developers.html][Double Entry Accounting for Developers — Django Hordak 1.0 documentation]]
- [[https://www.mathstat.dal.ca/~selinger/accounting/tutorial.html][Peter Selinger: Tutorial on multiple currency accounting]]
- [[https://beancount.github.io/docs/the_double_entry_counting_method.html][The Double Entry Counting Method - Beancount Documentation]]
