content/posts/double_entry_accounting.md
+++
title = "Double-entry Accounting"
author = ["Jethro Kuan"]
draft = false
+++

Double-entry accounting has several five components:

Assets
: what you have

Liability
: what you owe

::

From here you can derive certain values:

Net worth
: assets - liabilities

Net income
: income - expenses

## Resources {#resources}

- [Double Entry Accounting for Developers — Django Hordak 1.0 documentation](https://django-hordak.readthedocs.io/en/latest/accounting-for-developers.html)
- [Peter Selinger: Tutorial on multiple currency accounting](https://www.mathstat.dal.ca/~selinger/accounting/tutorial.html)
- [The Double Entry Counting Method - Beancount Documentation](https://beancount.github.io/docs/the%5Fdouble%5Fentry%5Fcounting%5Fmethod.html)
